<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-fix-routes","backend_type":"remote","backend":"eafb4ca5bd6b7000a9c9f8678d613899c339e509d314bf7fd436528923893c39","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #199 at https://github.com/scidsg/hushline/actions/runs/10454886410","plan_out_hash":"c39d111860bf93543b1606986eda07bca4ed3e5b4b89b519a70b476726d5e9de","plan_hash":"d76967787324a8e4e56f4def0e57959352ad3d3d670af205c78e96ae41c82c7b","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-fix-routes__ workspace<details open><summary>With variables</summary>

```hcl
branch = "fix-routes"
name   = "dev-fix-routes"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_project.hush_line_dev will be created
+   resource "digitalocean_project" "hush_line_dev" {
+       created_at  = (known after apply)
+       description = "Development instance based on the fix-routes branch"
+       environment = "Development"
+       id          = (known after apply)
+       is_default  = false
+       name        = "dev-fix-routes"
+       owner_id    = (known after apply)
+       owner_uuid  = (known after apply)
+       purpose     = "Web Application"
+       resources   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "dev-fix-routes"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "fix-routes"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #199](https://github.com/scidsg/hushline/actions/runs/10454886410)